app/controllers/users_controller.rb

SELECT * FROM `escuelas` WHERE (`escuelas`.`clave` = '07EPRO209E') LIMIT 1
SELECT `users`.id FROM `users` WHERE (`users`.`login` = BINARY '07epro209e') LIMIT 1
INSERT INTO `users` (`salt`, `created_at`, `activated_at`, `nombre`, `crypted_password`, `remember_token_expires_at`, `updated_at`, `activation_code`, `escuela_id`, `remember_token`, `login`, `email`) VALUES('4204be79a6cab2928f7bf4eefdc0ea6694cbecb1', '2013-08-07 13:56:48', NULL, NULL, '6ad91f4ba440b6568a2a910a829ad67af22c4c88', NULL, '2013-08-07 13:56:48', '4aae188e3e494392719eed7df2d1a1269e124a68', NULL, NULL, '07epro209e', 'elreyazucar@gmail.com')
---
  def create
    logout_keeping_session!
    @user = User.new(params[:user])
    @escuela = Escuela.find_by_clave(@user.login.upcase) if @user.login
    if User.find_by_login(@user.login)
      flash[:error]  = "Escuela ya existe registrada"
      render :action => 'new'
    else
       @user.activated_at = Time.now
        if @escuela
            success = @user && @user.save